microdron-itesm/MicroDronITESM/MicroDron/firmware/src/system_config/default/framework/peripheral/sqi/processor/sqi_p32mz2048ecm100.h
PLIB_INLINE_API bool PLIB_SQI_ExistsCommandStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsCommandStatus_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_DataLineStatus(SQI_MODULE_ID index, uint8_t dataPin)
{
     return SQI_DataLineStatus_Default(index, dataPin);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDataPinStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsDataPinStatus_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ReceiveBufferIsUnderrun(SQI_MODULE_ID index)
{
     return SQI_ReceiveBufferIsUnderrun_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxUnderRun(SQI_MODULE_ID index)
{
     return SQI_ExistsRxUnderRun_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_TransmitBufferHasOverflowed(SQI_MODULE_ID index)
{
     return SQI_TransmitBufferHasOverflowed_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxOverFlow(SQI_MODULE_ID index)
{
     return SQI_ExistsTxOverFlow_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMAEnable(SQI_MODULE_ID index)
{
     SQI_DMAEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMADisable(SQI_MODULE_ID index)
{
     SQI_DMADisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMAIsEnabled(SQI_MODULE_ID index)
{
     return SQI_DMAIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDmaEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsDmaEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDPollEnable(SQI_MODULE_ID index)
{
     SQI_DMABDPollEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDPollDisable(SQI_MODULE_ID index)
{
     SQI_DMABDPollDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMABDPollIsEnabled(SQI_MODULE_ID index)
{
     return SQI_DMABDPollIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDPollingEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsBDPollingEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDFetchStart(SQI_MODULE_ID index)
{
     SQI_DMABDFetchStart_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDFetchStop(SQI_MODULE_ID index)
{
     SQI_DMABDFetchStop_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMABDFetch(SQI_MODULE_ID index)
{
     return SQI_ExistsDMABDFetch_Default(index);
}

PLIB_INLINE_API void* PLIB_SQI_DMABDCurrentAddressGet(SQI_MODULE_ID index)
{
     return SQI_DMABDCurrentAddressGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDCurrentAddress(SQI_MODULE_ID index)
{
     return SQI_ExistsBDCurrentAddress_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDBaseAddressSet(SQI_MODULE_ID index, void* baseBDAddress)
{
     SQI_DMABDBaseAddressSet_Default(index, baseBDAddress);
}

PLIB_INLINE_API void* PLIB_SQI_DMABDBaseAddressGet(SQI_MODULE_ID index)
{
     return SQI_DMABDBaseAddressGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDBaseAddress(SQI_MODULE_ID index)
{
     return SQI_ExistsBDBaseAddress_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDProcessState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDProcessState_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMAHasStarted(SQI_MODULE_ID index)
{
     return SQI_DMAHasStarted_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMAProcessInProgress(SQI_MODULE_ID index)
{
     return SQI_ExistsDMAProcessInProgress_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMABDIsBusy(SQI_MODULE_ID index)
{
     return SQI_DMABDIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMAEngineBusy(SQI_MODULE_ID index)
{
     return SQI_ExistsDMAEngineBusy_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_SQI_DMABDControlWordGet(SQI_MODULE_ID index)
{
     return SQI_DMABDControlWordGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDControlWord(SQI_MODULE_ID index)
{
     return SQI_ExistsBDControlWord_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDPollCounterSet(SQI_MODULE_ID index, uint16_t pollCount)
{
     SQI_DMABDPollCounterSet_Default(index, pollCount);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDPollCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDPollCount_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDTransmitStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxState_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDTransmitBufferCountGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitBufferCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxBufCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxBufCount_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDTransmitBufferLengthGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitBufferLengthGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxLength(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxLength_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDReceiveStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxState_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDReceiveBufferCountGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveBufferCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxBufCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxBufCount_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDReceiveBufferLengthGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveBufferLengthGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxLength(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxLength_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ControlBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_ControlBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_ControlBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_ControlBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsConBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptSignalEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptSignalEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptSignalDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptSignalDisable_Default(index, interruptFlag);
}

